package hw03;

import java.util.Scanner;

/**
 * Created by Shpakovski on 09.06.2016.
 */
public class HW03 {
    public static void main(String [] args) {
        Scanner scann = new Scanner(System.in);

       /* Задание 1
        В три переменные a, b и c записаны три вещественных числа. Создать программу, которая
        будет находить и выводить на экран вещественные корни квадратного уравнения ax²+bx+c=0,
                либо сообщать, что корней нет.*/
        System.out.println("Задание 1:");

        double a, b, c;
        a = 3.1415;
        b = 1.618;
        c = 1.4142;

      /*  Задание 2
        Используя IntelliJ IDEA, создайте класс Calculator.
        Напишите программу - консольный калькулятор.
                Введите с консоли две переменные. Предложите пользователю ввести знак арифметической операции.
        Для организации выбора алгоритма вычислительного процесса, используйте оператор switch.
        Выведите на экран результат выполнения арифметической операции.
                В случае использования операции деления, организуйте проверку попытки деления на ноль.
                И если таковая имеется, то отмените выполнение арифметической операции и уведомите об ошибке
        пользователя.*/

        System.out.println("Задание 2");


    }
}
