package hw01;
public class HW02 {
    public static void main(String[] args) {

        /* Создать программу, проверяющую и сообщающую на экран, является ли  целое число, чётным либо нечётным */

        int b = 26;
        if((b % 2) == 0) {
            System.out.println("Число 26 чётное");
        }
        else {
            System.out.println("Число 26 нечётное");
        }

        /* Создать программу, выводящую на экран ближайшее к 10 из двух чисел.
Например, среди чисел 8,5 и 11,45 ближайшее к десяти 11,45. */

        int a = 10;
        int c = 5;
        int d = 9;

        if((a - c) > (a - d)||(a - c)< (a-d));
        {
            System.out.println(d);
        }

        int a1 = 1;
        int a2 = 2;

        if(a1 < a2);
        {
            System.out.println("a1 < a2");}


/* В три переменные a, b и c записаны три вещественных числа. Создать программу, которая
будет находить и выводить на экран вещественные корни квадратного уравнения ax²+bx+c=0,
либо сообщать, что корней нет. */

        float f = 1;
        float n = 12;
        float g = 36;

        double m = (n * n)-(4 * f * g);
        float e = 0;
        float p = 0;









        }


    }

