package hw02;

/**
 * Created by Shpakovski on 09.06.2016.
 */
public class hw02 {
    public static void main(String[] args){
        /* Задание 2
        Создать программу, проверяющую и сообщающую на экран, является ли  целое число, чётным либо нечётным. */

        int a = 123;
        System.out.println("Задание 2:" + "\n");

        if ((a % 2) == 0) {
            System.out.println("Число 123 - " + "четное");
        }
        else {
            System.out.println("Число 123 - " + "нечетное");
        }

        /* Задание 3
        Создать программу, выводящую на экран ближайшее к 10 из двух чисел.
        Например, среди чисел 8,5 и 11,45 ближайшее к десяти 11,45. */

        int b = 100;


        System.out.println("Задание 3:" + "\n");

    }
}
