package hw02;

import java.util.Scanner;

import static java.lang.System.in;

/**
 * Created by Shpakovski on 13.06.2016.
 */
public class Interval {
    public static void main(String[] args) {

        Scanner scann = new Scanner(in);

        final int x;
        String s;

        System.out.println("Enter your number: ");

        x = scann.nextInt();






/*        Задание 3
        Используя IntelliJ IDEA, создайте класс Interval.
        Напишите программу определения, попадает ли введенное пользователем число от 0 до 100 в числовой
        промежуток [0 - 14) [14 - 35] (35 - 50] [50 - 100]. Если да, то укажите, в какой именно промежуток.
                Если пользователь указывает число не входящее ни в один из имеющихся числовых промежутков, то
        выводится соответствующее сообщение.*/


    }

}
